{
  "test": "world_building",
  "passed": true,
  "score": 11,
  "thinking_time": 70.72390294075012,
  "found_sections": 6,
  "indicators": {
    "has_sections": true,
    "has_named_elements": true,
    "has_structure": true,
    "has_sufficient_detail": true,
    "is_creative": true
  },
  "response": "# **World-Building Document: *The Resonance Veil***  \n\n---\n\n## **1. PHYSICS**  \nIn *The Resonance Veil*, reality is governed by **Vibrational Equilibrium**—a principle where all matter and energy exist as oscillating frequencies within a cosmic lattice called the *Harmonic Grid*. Unlike our universe’s reliance on particles and forces, objects here are defined by their **Resonant Signature**, a unique frequency pattern that determines their form, properties, and interactions.  \n\n- **Magic System**: *Resonance Weaving* allows beings to manipulate frequencies to alter matter, heal wounds, or create constructs. However, overuse risks **Dissonance**, a chaotic state where frequencies clash, causing physical or mental instability.  \n- **Gravity & Motion**: Gravity is a low-frequency vibration that anchors lifeforms to the planet. Movement requires maintaining a balance between high and low frequencies; sprinting accelerates higher frequencies, while floating requires harmonic synchronization with the grid.  \n- **Light & Time**: Light travels as pulses of resonance, and time is perceived as the rate at which frequencies shift. A \"day\" is the time it takes for the planet’s core resonance to complete a full cycle.  \n\n---\n\n## **2. GEOGRAPHY**  \n### **A. The Harmonic Plains**  \n- **Characteristics**: A vast, flat expanse of crystalline grasslands that hum with steady, low-frequency vibrations. The plains emit a soothing resonance that stabilizes nearby ecosystems.  \n- **Unique Feature**: *Echo Wells*—natural springs that amplify sound waves, allowing communication across great distances.  \n\n### **B. The Dissonant Wastes**  \n- **Characteristics**: A desert of jagged, shifting rock formations that emit erratic, high-frequency vibrations. The terrain is unstable, with \"resonance storms\" that randomly alter the landscape.  \n- **Unique Feature**: *Fractured Canyons*—deep chasms where fragments of ancient resonance patterns are trapped, creating pockets of time distortion.  \n\n### **C. The Echoing Wilds**  \n- **Characteristics**: A dense, ever-changing forest where trees store memories as resonant imprints. The forest’s frequency shifts with the emotions of its inhabitants, causing flora and fauna to morph in real-time.  \n- **Unique Feature**: *Whispering Roots*—trees that can \"speak\" by replaying past events stored in their trunks, though accessing these memories risks mental fragmentation.  \n\n---\n\n## **3. SOCIETY**  \n### **A. The Harmonic Concord** (Harmonic Plains)  \n- **Organization**: A theocratic oligarchy led by the *Resonance Priests*, who interpret the Harmonic Grid’s patterns. Society is stratified into castes based on one’s ability to \"tune\" into frequencies.  \n- **Culture**: Emphasis on harmony, with art and architecture designed to blend seamlessly with the plains’ resonance.  \n\n### **B. The Shattered Clans** (Dissonant Wastes)  \n- **Organization**: Nomadic tribes that form temporary alliances during resonance storms. Leadership is fluid, based on who can best navigate the unstable terrain.  \n- **Culture**: A philosophy of chaos and adaptation, with rituals to \"shed\" excess frequencies to survive.  \n\n### **C. The Veilkeepers** (Echoing Wilds)  \n- **Organization**: A secretive, decentralized society that communicates through resonance echoes. They reject written records, relying on oral traditions encoded in the forest’s frequencies.  \n- **Culture**: Deep reverence for memory and history, with a taboo against altering the past.  \n\n---\n\n## **4. CONFLICT**  \n**The Resonance Divide**: The Harmonic Concord seeks to impose order on the Dissonant Wastes by harvesting Echo Wells to stabilize the region. The Shattered Clans resist, fearing the loss of their chaotic freedom. The Veilkeepers, meanwhile, warn that both sides risk unraveling the Harmonic Grid by disrupting its natural balance.  \n\n---\n\n## **5. HISTORY**  \n1. **The Resonance Awakening (1,000 years ago)**: Early civilizations discovered how to manipulate frequencies, leading to the creation of the first Echo Wells.  \n2. **The Shattering of the Harmonic Core (500 years ago)**: A failed attempt to merge the Harmonic Plains and Dissonant Wastes caused a resonance storm that split the world into its current regions.  \n3. **The Echo War (300 years ago)**: The Veilkeepers intervened to stop a Concord expedition from draining the Echoing Wilds’ memories, forcing a truce.  \n4. **The Rise of the Resonant Order (100 years ago)**: The Concord established a network of Echo Wells to control resonance, sparking rebellion among the Shattered Clans.  \n5. **The Fracture Accord (Present)**: A fragile peace treaty prohibits large-scale resonance manipulation, but tensions simmer as new technologies threaten the balance.  \n\n---\n\n## **6. UNIQUE ELEMENT: The *Echo Memory* Phenomenon**  \nIn the Echoing Wilds, trees store not just environmental data but **emotional imprints** of all living beings that have passed through. When a tree dies, its stored memories are released as a burst of resonance, temporarily altering the perceptions of nearby lifeforms. This creates a cyclical, collective memory archive, but accessing it risks \"memory bleed\"—a condition where individuals lose their personal identity to the echoes of the past.  \n\n---  \n*The Resonance Veil* is a world where existence is a symphony of frequencies, and survival depends on understanding the delicate balance between harmony and chaos."
}